Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/svd/PIC32CM5164LS60100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DSU">
         <name>DSU_EXT</name>
         <prependToName>DSU_EXT_</prependToName>
         <baseAddress>0x41002100</baseAddress>
      </peripheral>
      <peripheral>
         <name>DWT</name>
         <description>Data Watchpoint and Trace</description>
         <groupName>DWT</groupName>
         <prependToName>DWT_</prependToName>
         <baseAddress>0xE0001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DWT_CTRL</name>
               <description>DWT Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x0B000000</resetValue>
               <fields>
                  <field>
                     <name>CYCCNTENA</name>
                     <description>CYCCNT enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTPRESET</name>
                     <description>POSTCNT preset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>POSTINIT</name>
                     <description>POSTCNT initial</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CYCTAP</name>
                     <description>Cycle count tap</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCTAP</name>
                     <description>Synchronization tap</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PCSAMPLENA</name>
                     <description>PC sample enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCTRCENA</name>
                     <description>Exception trace enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPIEVTENA</name>
                     <description>CPI event enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCEVTENA</name>
                     <description>Exception event enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLEEPEVTENA</name>
                     <description>Sleep event enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSUEVTENA</name>
                     <description>LSU event enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FOLDEVTENA</name>
                     <description>Fold event enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCEVTENA</name>
                     <description>Cycle event enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCDISS</name>
                     <description>Cycle counter disabled secure</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOPRFCNT</name>
                     <description>No profile counters</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOCYCCNT</name>
                     <description>No cycle count</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOEXTTRIG</name>
                     <description>No external triggers</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTRCPKT</name>
                     <description>No trace packets</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NUMCOMP</name>
                     <description>Number of comparators</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_PCSR</name>
               <description>DWT Program Counter Sample Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EIASAMPLE</name>
                     <description>Executed instruction address sample</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>2</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>COMPARATOR[%s]</name>
               <description/>
               <addressOffset>0x020</addressOffset>
               <register>
                  <name>DWT_COMP</name>
                  <description>DWT Comparator Register n</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>VALUE</name>
                        <description>Cycle/PC/data value or data address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DWT_FUNCTION</name>
                  <description>DWT Function Register x</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>MATCH</name>
                        <description>Match type</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>ACTION</name>
                        <description>Action on match</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>DATAVSIZE</name>
                        <description>Data value size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>MATCHED</name>
                        <description>Comparator matched</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ID</name>
                        <description>Identify capability</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>DWT_LAR</name>
               <description>DWT Software Lock Access Register</description>
               <addressOffset>0xFB0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Lock access control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>UNLOCK</name>
                           <description>Unlock key value</description>
                           <value>0xC5ACCE55</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_LSR</name>
               <description>DWT Software Lock Status Register</description>
               <addressOffset>0xFB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SLI</name>
                     <description>Software Lock implemented</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLK</name>
                     <description>Software Lock status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nTT</name>
                     <description>Not thirty-two bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_DEVARCH</name>
               <description>DWT Device Architecture Register</description>
               <addressOffset>0xFBC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x47701A02</resetValue>
               <fields>
                  <field>
                     <name>ARCHPART</name>
                     <description>Architecture Part</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ARCHVER</name>
                     <description>Architecture Version</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRESENT</name>
                     <description>DEVARCH Present</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARCHITECT</name>
                     <description>Architect</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_DEVTYPE</name>
               <description>DWT Device Type Register</description>
               <addressOffset>0xFCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MAJOR</name>
                     <description>Major type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUB</name>
                     <description>Sub-type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_PIDR4</name>
               <description>DWT Peripheral Identification Register 4</description>
               <addressOffset>0xFD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_2</name>
                     <description>JEP106 continuation code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>4KB count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_PIDR5</name>
               <description>DWT Peripheral Identification Register 5</description>
               <addressOffset>0xFD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>DWT_PIDR6</name>
               <description>DWT Peripheral Identification Register 6</description>
               <addressOffset>0xFD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>DWT_PIDR7</name>
               <description>DWT Peripheral Identification Register 7</description>
               <addressOffset>0xFDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>DWT_PIDR0</name>
               <description>DWT Peripheral Identification Register 0</description>
               <addressOffset>0xFE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_0</name>
                     <description>Part number bits[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_PIDR1</name>
               <description>DWT Peripheral Identification Register 1</description>
               <addressOffset>0xFE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_1</name>
                     <description>Part number bits[11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DES_0</name>
                     <description>JEP106 identification code bits [3:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_PIDR2</name>
               <description>DWT Peripheral Identification Register 2</description>
               <addressOffset>0xFE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_1</name>
                     <description>JEP106 identification code bits[6:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEDEC</name>
                     <description>JEDEC assignee value is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Component revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_PIDR3</name>
               <description>DWT Peripheral Identification Register 3</description>
               <addressOffset>0xFEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>Customer Modified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>RevAnd</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_CIDR0</name>
               <description>DWT Component Identification Register 0</description>
               <addressOffset>0xFF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_0</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_CIDR1</name>
               <description>DWT Component Identification Register 1</description>
               <addressOffset>0xFF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000090</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_1</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLASS</name>
                     <description>CoreSight component class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_CIDR2</name>
               <description>DWT Component Identification Register 2</description>
               <addressOffset>0xFF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_2</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DWT_CIDR3</name>
               <description>DWT Component Identification Register 3</description>
               <addressOffset>0xFFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_3</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
